<html lang="es">
    <head>
        <title>ICC - Luciano Aguirre</title>
        <meta name="description" content="Una p&#225;gina Web para ICC.">

        <link rel="stylesheet" href="styles.css">
        <script type="text/javascript" src="index.js"></script>
    </head>
    
    <body class="home">
        <nav class="navbar">
            <ul class="nav-list">
                <li class= "nav-list-item"><a href="./">&#127969; Home</a></li>
                <li class= "nav-list-item"><a href="./curso.html">&#128511; Curso</a></li>
            </ul>
        </nav>

        <main class="container">
            <div class="container-text">
                <div class="class-body">
                    <h3>Computer Science</h3>
                    <p>Computer Science (C.S.) es el estudio de las computadoras.</p>
                    <br>
                    <h3>Arquitectura de Computadores</h2>
                    <p>Los principales componentes en una computadora son: <b>CPU</b>, <b>RAM</b>, <b>GPU</b> y <b>SSD/HDD</b>.</p>
                    <p><span class="tab"></span>- CPU (Central Processing Unit) &#8594; Encargado de procesar y ejecutar secuencias de instrucciones.</p>
                    <p><span class="tab"></span>- RAM (Random Access Memory) &#8594; Unidad de almacenamiento temporal. Ayuda al CPU a tener un acceso m&#225;s r&#225;pido a la informaci&#243;n.</p>
                    <p><span class="tab"></span>- GPU (Graphics Processing Unit) &#8594; Sirve para procesar grandes cantidades de informaci&#243;n en paralelo. A diferencia del CPU, el GPU contiene miles de n&#250;cleos, haciendo que procese informaci&#243;n de forma m&#225;s eficiente.</p>
                    <p><span class="tab"></span>- SSD / HDD &#8594; Los discos de almacenamiento sirven para guardar informaci&#243;n de forma permanente (Hasta que se elimine). Los SSD utilizan chips de memoria NAND, mientras que los discos HDD utilizan discos r&#237;gidos giratorios.</p>
                    <br>
                    <h3>Sistemas Operativos</h3>
                    <p>Los Sistemas Operativos tienen 3 funciones principales:</p>
                    <p><span class="tab"></span>1. Controlar operaciones de inputs/outputs.</p>
                    <p><span class="tab"></span>2. Asignaci&#243;n de Memoria &#8594; Se encarga de distribuir la memoria disponible seg&#250;n las necesidades.</p>
                    <p><span class="tab"></span>3. Ejecutar Programas &#8594; Se encarga de ejecutar programas siguiendo el patr&#243;n:</p>
                    <p><b>.. NEW &#8594; READY &#8592; (WAITING) &#8592; RUNNING &#8594; TERMINATED</b></p>
                    <br>
                    <h3>Redes</h2>
                    <p>El networking sirve para conectar a distintos usuarios entre si, para compartir datos y recursos. Esto se puede lograr a trav&#233;s de conexiones LAN o WAN mediante un Switch.</p>
                    <p>Las conexiones Cliente - Servidor se logran cuando el cliente env&#237;a un request al servidor, y este escucha el request, lo procesa y da una respuesta.</p>
                    <br>
                    <h3>Web</h3>
                    <p>La Web 1.0 serv&#237;a &#250;nicamente para leer. Los lectores acced&#237;an a art&#237;culos, informaci&#243;n y contenido de las limitadas fuentes.</p>
                    <p>A partir de la Web 2.0 se pudo escribir adem&#225;s de leer. Esto impuls&#243; a la gente a participar y aportar en la creaci&#243;n de estas p&#225;ginas.</p>
                    <p>Finalmente, la Web 3.0 consiste en la Descentralizaci&#243;n, tecnolog&#237;a Blockchain, etc.</p>
                </div>
            </div>
        </main>
    </body>
</html>